the 3494948
, 3192520
. 2778965
to 1627949
of 1464653
and 1420233
a 1404513
in 1253491
'' 795370
`` 794988
's 731543
that 688883
for 541812
is 526390
said 488852
it 477825
on 469496
was 449757
he 415669
with 386133
as 332809
i 315575
-- 295923
at 287032
have 283183
his 280677
are 271054
from 264966
be 257301
but 253764
this 237803
has 236980
by 236880
not 232440
they 224333
an 223944
we 223486
who 197788
you 182609
) 171086
cnn 169860
n't 169608
( 169387
were 167840
will 165380
she 164158
their 163152
: 154841
had 152582
about 151337
her 150055
more 145834
been 145794
or 143934
one 142186
people 138749
there 132937
when 129902
after 126690
do 120200
what 118890
would 117003
' 114057
all 113560
which 110237
out 108348
new 106748
can 105879
also 104054
up 103766
its 99959
if 98384
so 94318
than 93698
? 91266
no 89459
some 88030
two 87821
time 87768
other 84382
just 82924
into 81694
told 80267
like 79075
them 77950
my 77649
first 76560
over 75927
years 75846
could 75494
our 74588
world 73548
u.s. 73413
him 70944
did 70686
last 69990
says 68074
president 67043
because 66242
year 66196
now 66002
according 65528
police 64762
government 63801
how 61909
many 61085
where 60778
those 60726
most 60489
before 58080
only 57757
state 57381
get 57135
$ 55880
while 55067
united 52451
your 52425
country 52340
being 51028
obama 50419
states 50190
any 49874
even 49827
against 49267
me 49082
very 49026
're 48971
back 48368
day 48028
these 47158
may 46941
make 46733
then 46657
made 45804
three 45654
way 45477
report 45087
think 44973
say 44586
through 44141
since 43842
still 43773
going 43554
know 43495
family 43167
during 42987
city 42461
home 41989
see 41774
take 41223
down 41191
such 40572
should 40235
much 39608
off 39204
group 38439
life 38260
; 38061
week 37961
us 37853
work 37494
does 37429
go 37326
national 37174
well 37053
another 36951
between 36853
want 36725
house 36551
court 36540
million 36519
security 36047
around 35843
officials 35457
military 35100
children 34789
women 34686
including 34669
statement 34643
found 34233
part 34216
news 33296
public 33269
both 33099
help 32278
american 32168
international 32168
former 32115
case 31753
under 31685
good 31668
called 31550
... 31190
man 31132
've 31119
right 30796
really 30666
tuesday 30434
law 30430
here 30266
days 30083
'm 29575
never 29412
monday 29312
show 29284
next 29144
own 28982
come 28899
health 28780
authorities 28724
south 28520
wednesday 28407
team 28399
same 28348
need 28289
school 28241
death 28227
place 28203
% 27980
killed 27706
political 27627
four 27614
thursday 27236
friday 27169
reported 27094
long 27083
every 27044
later 26787
used 26759
took 26164
use 26121
north 25826
too 25719
best 25693
end 25691
york 25644
war 25483
why 25061
rights 25060
came 24977
department 24863
something 24837
sunday 24836
second 24565
support 24521
office 24390
without 24184
left 24085
got 24002
official 23896
lot 23862
whether 23788
company 23770
put 23618
members 23589
men 23492
set 23378
few 23333
five 23070
white 22986
media 22960
night 22728
china 22715
10 22652
little 22577
things 22565
away 22561
high 22543
party 22402
number 22308
top 22293
federal 22252
might 22237
several 22218
month 22097
times 22046
each 21832
saying 21779
least 21775
washington 21711
asked 21609
great 21548
contributed 21507
months 21497
past 21229
among 21164
young 21145
power 21120
others 21016
big 20910
until 20891
went 20822
today 20478
saturday 20392
find 20270
! 20251
center 20119
money 19980
look 19780
change 19720
video 19712
care 19659
forces 19655
information 19609
ago 19515
area 19503
attack 19453
better 19394
recent 19304
early 19212
far 18975
game 18962
america 18925
across 18916
known 18909
human 18889
system 18866
university 18862
working 18790
again 18665
always 18662
however 18547
already 18545
added 18512
different 18375
become 18348
local 18322
watch 18291
service 18287
water 18276
died 18274
minister 18235
believe 18209
spokesman 18096
able 18090
once 17995
though 17964
agency 17951
story 17945
point 17936
seen 17888
nation 17845
campaign 17715
taken 17607
making 17605
trying 17591
violence 17585
community 17553
open 17551
woman 17517
real 17456
countries 17289
must 17208
person 17167
released 17140
program 17115
john 17019
'll 17016
earlier 16993
having 16872
air 16818
call 16818
win 16806
iraq 16788
hours 16778
important 16755
mother 16746
yet 16727
six 16612
give 16590
history 16539
face 16493
head 16406
thing 16368
wrote 16352
keep 16349
business 16252
side 16235
major 16224
less 16220
behind 16181
control 16166
investigation 16150
social 16130
issue 16124
started 16117
doing 16109
decision 16063
began 15984
enough 15948
taking 15933
read 15918
live 15891
father 15865
feel 15835
defense 15795
ca 15790
americans 15746
director 15715
syria 15707
site 15652
play 15644
love 15641
season 15618
administration 15551
outside 15546
foreign 15544
black 15497
iran 15496
clear 15468
ever 15455
leader 15296
1 15294
along 15286
attorney 15210
lost 15210
car 15188
child 15162
often 15149
leaders 15138
held 15091
fire 15035
name 14992
small 14988
california 14918
free 14910
future 14879
hospital 14870
done 14863
medical 14854
wanted 14819
near 14803
hard 14768
attacks 14755
weeks 14744
food 14739
given 14699
body 14692
groups 14671
move 14652
getting 14607
20 14605
general 14602
final 14567
won 14550
al 14526
deal 14490
shot 14484
start 14455
kind 14451
west 14402
force 14375
possible 14354
republican 14344
hit 14321
bill 14318
london 14314
percent 14308
thought 14298
let 14215
run 14202
son 14183
county 14170
together 14158
using 14136
job 14134
'd 14037
late 14012
fact 13976
justice 13947
am 13934
africa 13891
likely 13880
old 13835
looking 13824
continue 13815
nearly 13784
chief 13753
despite 13747
issues 13743
lives 13732
parents 13710
friends 13666
close 13648
congress 13647
announced 13558
league 13543
hope 13528
region 13521
russia 13512
within 13497
saw 13488
race 13445
students 13430
economic 13385
british 13382
became 13335
process 13242
charges 13234
election 13224
almost 13154
policy 13123
problem 13092
comes 13066
plan 13039
someone 13016
stop 13013
action 12954
following 12926
evidence 12904
2011 12902
expected 12821
sure 12820
2012 12791
phone 12778
try 12738
film 12676
wife 12646
course 12599
lead 12576
senate 12576
led 12561
2 12524
vote 12497
afghanistan 12490
act 12441
incident 12424
minutes 12422
facebook 12411
involved 12404
korea 12402
coming 12397
situation 12379
clinton 12313
happened 12311
nothing 12299
morning 12284
line 12244
full 12238
tell 12192
town 12192
third 12172
football 12170
miles 12168
judge 12133
inside 12130
reports 12126
recently 12120
flight 12115
arrested 12099
players 12090
anything 12084
families 12074
prison 12070
nations 12037
release 12037
website 12019
30 12011
israel 12008
club 12001
role 11992
everything 11943
himself 11910
republicans 11891
dead 11890
half 11886
2010 11883
record 11829
organization 11788
safety 11763
cases 11755
legal 11753
chinese 11741
2008 11685
fight 11655
[ 11643
] 11641
drug 11616
everyone 11590
event 11565
michael 11560
order 11558
officer 11492
online 11487
european 11479
democratic 11444
prime 11438
thousands 11438
army 11435
question 11432
fans 11398
talk 11394
troops 11392
march 11386
committee 11385
large 11371
pay 11327
officers 11325
music 11316
building 11291
based 11273
whose 11231
east 11229
trial 11203
games 11192
means 11183
room 11159
2009 11114
actually 11105
instead 11079
special 11074
living 11061
capital 11052
age 11051
friend 11048
victims 11041
return 11035
cup 11032
leave 11032
nuclear 11003
interview 10940
presidential 10935
border 10915
received 10900
experience 10899
oil 10895
makes 10883
problems 10882
park 10881
series 10870
efforts 10865
king 10856
bring 10846
billion 10838
jackson 10837
sent 10814
pakistan 10805
civil 10762
further 10758
florida 10757
january 10715
plane 10707
kids 10705
reporters 10691
student 10691
although 10678
travel 10675
15 10669
weapons 10655
gave 10642
twitter 10642
workers 10620
book 10582
isis 10580
shows 10574
played 10565
french 10529
bad 10522
key 10503
difficult 10494
middle 10493
airport 10485
ground 10483
street 10483
areas 10481
tv 10452
front 10430
accused 10424
strong 10424
remains 10421
secretary 10388
killing 10300
current 10293
global 10280
seven 10269
shooting 10247
september 10232
provide 10221
mexico 10185
especially 10169
space 10166
needs 10139
soon 10132
daughter 10129
senior 10121
turned 10073
worked 10068
matter 10064
response 10058
district 10056
david 10050
union 10049
star 10036
heard 10026
meeting 10021
los 10009
june 10001
research 9999
questions 9990
economy 9964
» 9950
opposition 9947
11 9941
12 9932
risk 9924
5 9905
tried 9900
press 9897
match 9867
red 9866
points 9863
forward 9860
anyone 9855
russian 9813
couple 9801
eight 9792
goal 9763
3 9747
idea 9741
movie 9732
democrats 9727
companies 9716
member 9669
personal 9664
gun 9660
100 9654
message 9654
texas 9654
access 9653
council 9653
themselves 9648
stay 9622
central 9596
level 9585
plans 9584
result 9578
brought 9576
fighting 9558
search 9552
career 9548
europe 9547
november 9546
peace 9546
knew 9531
france 9503
private 9482
heart 9470
services 9470
list 9464
angeles 9451
hotel 9450
ahead 9438
crisis 9409
syrian 9397
board 9333
met 9333
girl 9285
running 9285
showed 9256
tour 9253
include 9244
latest 9243
chance 9236
technology 9218
victory 9213
island 9201
internet 9190
qaeda 9160
visit 9140
april 9132
charged 9128
industry 9124
july 9121
expressed 9119
education 9117
rather 9099
residents 9091
spent 9080
described 9078
felt 9066
african 9064
potential 9044
attention 9041
helped 9035
similar 9034
brown 9031
murder 9030
calls 9027
market 9023
50 9018
bush 9009
turn 8981
cause 8977
romney 8964
moment 8929
ministry 8927
effort 8923
december 8917
weekend 8917
coast 8912
probably 8895
data 8872
india 8865
england 8848
husband 8835
jobs 8795
serious 8789
wo 8784
study 8782
crime 8753
popular 8740
project 8737
barack 8736
criminal 8729
college 8689
step 8679
needed 8667
grand 8664
u.n. 8664
wants 8662
remain 8653
reason 8635
events 8623
playing 8612
share 8578
girls 8577
immediately 8574
conference 8566
leading 8545
financial 8538
intelligence 8535
japan 8525
hand 8517
appeared 8505
staff 8503
whole 8486
speech 8483
energy 8482
paul 8482
emergency 8455
due 8440
marriage 8421
church 8415
post 8405
4 8342
words 8323
hundreds 8317
network 8310
protesters 8303
august 8269
october 8268
2007 8261
sense 8261
continued 8249
toward 8244
available 8223
executive 8223
web 8220
source 8219
television 8207
disease 8203
debate 8193
threat 8169
player 8152
hold 8146
mark 8135
happen 8122
training 8121
enforcement 8094
investigators 8089
moved 8047
southern 8040
meet 8039
sometimes 8037
growing 8035
february 8029
missing 8022
scene 8017
majority 8014
& 8011
safe 8008
true 8007
allowed 8001
success 7995
ask 7987
decided 7981
sen. 7972
soldiers 7964
create 7961
allow 7941
arrest 7937
either 7921
understand 7912
voters 7904
longer 7880
mission 7880
hearing 7866
2013 7856
alleged 7851
society 7847
failed 7845
protect 7836
opinion 7832
feet 7818
issued 7814
biggest 7788
cost 7768
storm 7766
included 7752
example 7728
wrong 7723
per 7719
san 7719
rest 7705
title 7690
opportunity 7684
short 7683
summer 7667
treatment 7664
else 7659
citizens 7646
george 7643
cut 7640
stand 7633
position 7632
dr. 7625
happy 7614
seems 7601
reach 7588
hands 7582
mean 7576
named 7576
protests 7573
quickly 7570
israeli 7563
cancer 7562
takes 7554
boy 7551
forced 7537
road 7530
egypt 7528
population 7524
comment 7517
movement 7509
25 7495
itself 7494
fbi 7493
gone 7489
charge 7487
photos 7478
decades 7477
stage 7453
injured 7451
largest 7446
test 7445
light 7440
western 7437
form 7436
bit 7410
sexual 7404
ways 7400
ukraine 7384
believed 7382
passengers 7379
simply 7364
huge 7350
calling 7329
impact 7321
focus 7303
40 7300
relationship 7298
pressure 7291
development 7289
trip 7288
comments 7285
northern 7283
single 7278
view 7263
perhaps 7259
laws 7250
homes 7249
tax 7245
armed 7228
de 7225
claims 7219
talking 7212
elections 7205
immigration 7204
bank 7203
parts 7193
prosecutors 7179
common 7178
considered 7136
goes 7134
apple 7116
address 7105
agreement 7096
regime 7093
offer 7083
spokeswoman 7065
18 7058
terrorist 7054
main 7053
details 7051
created 7041
letter 7032
passed 7032
muslim 7028
challenge 7025
confirmed 7021
results 7009
spending 7003
caused 7002
conditions 6994
streets 6987
gop 6976
maybe 6975
weather 6970
8 6967
freedom 6961
doctors 6953
land 6932
spoke 6921
sea 6918
concerns 6915
martin 6909
changed 6896
posted 6890
conflict 6883
fall 6878
supreme 6874
politics 6864
patients 6863
field 6860
meanwhile 6860
documents 6840
beyond 6839
followed 6827
significant 6824
ended 6819
deaths 6817
brother 6815
daily 6813
korean 6809
nine 6799
fear 6789
association 6788
germany 6788
guilty 6787
gas 6784
taliban 6784
station 6783
supporters 6772
certain 6763
interest 6741
6 6735
users 6718
aid 6707
break 6703
battle 6681
identified 6680
finally 6670
ship 6667
returned 6659
e-mail 6658
suspect 6642
16 6629
2006 6622
adding 6601
schools 6600
google 6593
claimed 6586
operation 6584
pretty 6581
page 6575
millions 6574
islamic 6566
previous 6560
14 6543
cities 6537
experts 6530
born 6519
aircraft 6514
works 6499
sports 6494
changes 6491
hear 6481
abuse 6462
easy 6456
quite 6456
lawyer 6442
increase 6437
culture 6436
crew 6428
denied 6423
stories 6421
james 6414
paid 6412
ready 6412
talks 6412
terms 6409
art 6405
- 6397
newspaper 6385
published 6384
raised 6384
sex 6382
term 6371
leadership 6368
voice 6362
giving 6353
blood 6350
entire 6349
eventually 6349
english 6348
actions 6346
currently 6346
base 6339
reform 6336
believes 6331
carolina 6330
opening 6323
conservative 6322
13 6309
champion 6308
operations 6301
leaving 6297
throughout 6297
reached 6291
georgia 6290
looked 6284
mind 6281
atlanta 6266
ban 6266
alone 6258
drugs 6258
allegations 6227
winning 6221
served 6217
particularly 6216
opinions 6199
sign 6191
hong 6189
gay 6183
claim 6175
damage 6162
total 6152
written 6151
round 6146
numbers 6144
responsible 6143
speak 6140
agreed 6114
period 6097
opened 6082
ruling 6075
addition 6073
britain 6060
illegal 6053
convicted 6052
manager 6051
sport 6034
kept 6022
remember 6019
2014 6017
fellow 6011
coach 6007
candidate 6004
scheduled 5998
baby 5990
places 5988
iraqi 5969
vice 5966
build 5962
account 5959
employees 5959
yes 5958
responsibility 5953
learned 5952
jury 5934
loss 5931
green 5928
god 5927
filed 5921
governor 5913
whom 5910
arrived 5904
victim 5901
17 5898
word 5895
crash 5893
includes 5893
parties 5893
hopes 5888
solely 5888
expect 5880
suffered 5879
signed 5870
7 5863
higher 5859
mayor 5852
trade 5852
turkey 5849
female 5846
robert 5838
certainly 5836
beat 5824
budget 5821
learn 5817
religious 5815
fired 5802
programs 5800
kong 5799
affiliate 5798
gets 5797
offered 5793
spain 5778
moving 5777
condition 5775
class 5768
australia 5767
rules 5761
prevent 5760
rule 5756
consider 5731
track 5730
williams 5728
lack 5726
effect 5709
price 5709
doctor 5699
reality 5692
answer 5685
magazine 5679
send 5678
dangerous 5675
follow 5671
hour 5670
p.m. 5670
guard 5665
store 5661
images 5653
above 5647
ability 5645
crimes 5643
river 5638
buy 5633
launched 5616
24 5613
low 5613
kill 5612
teams 5610
wounded 5609
eastern 5604
afternoon 5595
allegedly 5594
poor 5590
concern 5589
provided 5585
occurred 5576
arab 5567
libya 5560
begin 5558
militants 5547
virginia 5545
helping 5542
beginning 5532
tournament 5531
tough 5530
planned 5521
civilians 5517
camp 5509
relations 5507
ones 5506
products 5506
worth 5504
cars 5498
records 5495
natural 5494
complete 5492
built 5489
wall 5489
speaking 5488
assault 5485
powerful 5485
strike 5484
champions 5481
commission 5479
guy 5478
jersey 5473
successful 5473
noted 5471
candidates 5450
9 5444
appears 5441
asking 5438
commentary 5437
authority 5430
mobile 5428
crowd 5422
host 5417
fourth 5406
carried 5393
bodies 5387
original 5384
request 5383
johnson 5379
2005 5376
attempt 5366
seeing 5364
seem 5363
amount 5354
faces 5354
looks 5354
german 5351
performance 5351
train 5346
related 5344
approach 5331
journalists 5328
rate 5328
chairman 5323
driving 5323
appear 5317
60 5311
winner 5308
secret 5303
critical 5301
growth 5299
concerned 5285
professor 5279
vehicle 5279
lines 5278
average 5277
italy 5272
sentence 5272
check 5270
closed 5270
st. 5265
additional 5264
committed 5261
iranian 5249
province 5239
driver 5238
door 5234
drive 5233
figure 5233
pass 5231
suicide 5223
saudi 5210
radio 5195
review 5191
sides 5190
beach 5187
domestic 5186
heavy 5185
sheriff 5181
gov 5178
knows 5175
boston 5172
join 5171
injuries 5169
avoid 5168
sources 5167
individual 5163
respect 5162
afghan 5159
version 5157
airlines 5156
independent 5155
square 5155
lived 5140
joined 5139
contact 5138
smith 5133
eyes 5131
starting 5131
ensure 5127
beijing 5125
uk 5118
feeling 5117
save 5102
picture 5101
seeking 5101
continues 5100
deep 5095
date 5093
stopped 5092
• 5092
century 5086
measures 5081
thinking 5078
protest 5077
cell 5070
choice 5070
positive 5065
science 5059
struck 5055
kim 5034
minute 5029
brazil 5020
married 5018
serve 5018
a.m. 5011
resources 5009
seemed 5008
levels 5001
broke 4996
status 4984
nearby 4983
insurance 4978
australian 4973
gold 4972
myself 4967
watching 4967
sites 4966
worst 4961
previously 4959
competition 4957
communities 4951
costs 4949
evening 4946
jail 4940
olympic 4940
traffic 4937
simple 4935
appeal 4928
massive 4928
exactly 4927
ordered 4923
paris 4919
affected 4910
policies 4908
2004 4907
favorite 4905
penalty 4905
ebola 4895
museum 4895
walk 4894
deputy 4889
foundation 4884
richard 4878
italian 4865
rebels 4862
range 4858
cover 4853
upon 4850
behavior 4840
fast 4838
rock 4838
earth 4836
spread 4831
famous 4830
lower 4829
fine 4828
loved 4825
various 4818
violent 4815
designed 4806
reasons 4803
cross 4800
japanese 4798
telling 4798
legislation 4796
mass 4789
clearly 4778
progress 4778
carry 4777
gulf 4770
chicago 4767
carrying 4766
character 4765
holding 4763
ran 4762
waiting 4761
actor 4753
computer 4750
19 4746
fell 4742
goals 4740
decade 4737
photo 4737
organizations 4718
showing 4718
sold 4717
books 4716
traditional 4713
rise 4711
steps 4711
target 4709
accident 4708
wait 4690
indian 4687
lose 4685
van 4680
disaster 4677
usually 4677
kennedy 4676
estimated 4675
greater 4674
necessary 4674
parliament 4672
spanish 4670
completely 4667
practice 4667
gaza 4666
mental 4663
arizona 4652
spend 4651
increased 4648
rep. 4648
entertainment 4647
launch 4638
bin 4630
image 4628
challenges 4613
journalist 4612
raise 4606
palestinian 4605
wearing 4604
management 4603
standing 4597
caught 4596
congressional 4592
sister 4590
activists 4584
band 4584
coalition 4583
nature 4582
protection 4578
names 4577
sound 4577
nato 4576
navy 4572
sanctions 4568
warned 4566
visitors 4560
sort 4556
bomb 4555
dream 4554
song 4554
model 4548
apparently 4545
terror 4543
below 4541
rescue 4533
becoming 4532
receive 4531
present 4523
fair 4522
individuals 4515
snow 4514
mccain 4508
measure 4498
boys 4497
pakistani 4496
fun 4492
systems 4492
treated 4492
primary 4481
honor 4473
ruled 4466
putin 4463
joe 4458
facility 4456
coverage 4449
modern 4448
critics 4446
dollars 4446
required 4446
terrorism 4441
audience 4440
200 4435
pain 4434
professional 4434
lee 4431
whatever 4426
mexican 4420
twice 4419
22 4418
injury 4414
21 4407
views 4405
brain 4403
note 4400
limited 4391
institute 4386
admitted 4385
discovered 4383
strategy 4382
benefits 4377
environment 4377
prosecutor 4375
fighters 4367
particular 4363
facing 4361
warning 4361
chris 4359
amid 4356
highest 4356
neighborhood 4350
suspected 4349
remained 4344
ocean 4343
cold 4339
draw 4337
bus 4335
finding 4332
connection 4331
ice 4331
lawsuit 4326
hot 4323
difference 4316
ball 4311
embassy 4302
standards 4302
piece 4301
normal 4300
planning 4300
winter 4290
hollywood 4284
activities 4279
climate 4279
putting 4279
spot 4273
everybody 4270
scott 4270
announcement 4268
fully 4268
responded 4267
captain 4265
physical 4264
veterans 4260
presence 4253
signs 4252
declined 4249
massachusetts 4246
multiple 4244
customers 4241
2001 4239
type 4239
language 4234
table 4231
dropped 4223
elected 4222
property 4222
stars 4221
directly 4217
camera 4215
die 4213
onto 4212
pilot 4210
refused 4204
annual 4201
rape 4200
determined 4199
demand 4198
royal 4193
defeat 4192
mostly 4191
worse 4189
generation 4186
threats 4184
declared 4175
affairs 4174
focused 4174
agents 4165
design 4161
author 4160
push 4160
truth 4159
older 4152
blue 4151
plant 4151
republic 4151
democracy 4146
aware 4144
meant 4141
trust 4132
losing 4129
pulled 4128
production 4125
happens 4122
weight 4122
fashion 4118
thomas 4118
nigeria 4113
compared 4109
subject 4105
revealed 4104
boat 4095
christian 4095
floor 4093
gives 4093
same-sex 4086
dark 4085
yemen 4079
agencies 4076
businesses 4076
shared 4068
2003 4067
perfect 4064
labor 4063
direct 4062
conversation 4058
murray 4057
herself 4056
influence 4049
lawyers 4046
dozens 4042
guns 4040
product 4038
hurt 4036
mr. 4035
canada 4034
colorado 4033
personnel 4031
pictures 4031
debt 4029
respond 4029
buildings 4028
scientists 4027
airline 4024
seek 4021
activity 4020
prepared 4020
poll 4017
eye 4006
sales 4004
explained 4002
village 4000
flights 3998
determine 3996
cuts 3992
largely 3986
jones 3985
fund 3983
witnesses 3981
william 3980
custody 3974
placed 3973
gadhafi 3972
decide 3970
specific 3968
shortly 3967
alive 3965
animals 3964
path 3960
tom 3948
assistance 3947
terrorists 3944
ceo 3943
doubt 3941
ongoing 3941
walking 3934
arms 3928
device 3927
overall 3925
survey 3925
beautiful 3922
chelsea 3920
box 3918
madrid 3918
nor 3918
transportation 3918
corruption 3917
joint 3915
controversial 3912
sentenced 3911
shown 3908
providing 3907
fuel 3904
firm 3901
golf 3899
vehicles 3898
paper 3889
commercial 3887
23 3882
constitution 3878
broken 3873
offers 3872
owner 3872
birth 3859
hall 3856
effective 3854
conducted 3853
immediate 3850
revolution 3848
ryan 3847
studies 3844
willing 3844
none 3840
asia 3839
thanks 3839
writing 3838
singer 3837
suspects 3835
failure 3834
decisions 3833
al-assad 3829
extremely 3829
suffering 3824
regional 3819
virus 3818
lawmakers 3817
flying 3815
restaurant 3812
sell 3800
seat 3798
via 3798
criticism 3797
younger 3794
conduct 3787
devices 3787
dog 3787
targeted 3785
credit 3777
civilian 3776
size 3773
ultimately 3772
muslims 3770
suggested 3770
improve 3765
value 3761
grew 3760
rates 3757
agree 3756
bringing 3754
material 3753
argued 3748
urged 3747
egyptian 3745
attacked 3744
prince 3742
finished 3739
christmas 3735
hoping 3732
messages 3723
equipment 3721
ii 3720
traveling 3720
interests 3719
mike 3719
quality 3719
rare 3717
premier 3714
26 3712
figures 3709
serving 3707
steve 3698
faith 3695
funding 3693
agent 3691
initially 3691
app 3689
chemical 3685
tests 3681
centers 3673
possibility 3673
pick 3670
sitting 3668
blog 3664
separate 3663
complex 3662
relief 3662
clean 3661
runs 3660
location 3659
ohio 3659
miss 3658
politicians 3657
youth 3657
article 3656
happening 3653
pope 3653
deadly 3652
proud 3649
scored 3647
accept 3640
journey 3636
olympics 3632
humanitarian 3631
mom 3631
governments 3625
peter 3625
laden 3624
straight 3624
partner 3623
stadium 3623
highly 3622
faced 3621
creating 3619
acts 3617
advantage 3617
ambassador 3613
surgery 3612
hamas 3610
solution 3610
historic 3608
27 3603
hillary 3603
surveillance 3599
witness 3599
assistant 3598
exchange 3598
increasingly 3585
voting 3584
pounds 3583
entered 3580
spring 3578
2002 3577
absolutely 3570
appearance 3570
combat 3570
initial 3566
knowledge 3562
captured 3561
bridge 3559
votes 3557
discuss 3556
keeping 3555
talked 3554
70 3552
guys 3547
barcelona 3546
videos 3546
cuba 3545
moments 3544
worldwide 3544
recovery 3542
cast 3541
hill 3539
operating 3538
patient 3535
involving 3533
severe 3532
bar 3529
la 3527
prices 3527
click 3525
privacy 3522
manchester 3521
publicly 3515
hair 3513
greatest 3509
turkish 3509
developed 3508
male 3504
eat 3501
acting 3497
finish 3487
zone 3486
fan 3484
style 3481
tea 3477
healthy 3472
voted 3471
indeed 3469
brothers 3466
movies 3462
obviously 3462
super 3462
nasa 3461
testing 3456
kilometers 3455
reduce 3455
grow 3454
unique 3448
tells 3446
anthony 3444
imagine 3437
threatened 3437
28 3435
matches 3435
ali 3434
amazing 3433
weekly 3432
seriously 3429
larger 3428
deeply 3427
screen 3425
stuff 3425
active 3420
cia 3418
seconds 3418
allowing 3417
yourself 3417
produced 3415
cultural 3414
album 3411
unable 3410
surprise 3406
giant 3397
somalia 3397
moscow 3393
speed 3391
fifth 3390
bay 3389
suit 3388
double 3387
rain 3384
80 3383
immigrants 3378
secure 3378
ideas 3374
sought 3374
ferguson 3372
resolution 3369
environmental 3365
removed 3365
add 3364
choose 3364
editor 3360
award 3353
counts 3352
bottom 3351
testified 3351
davis 3348
haiti 3344
construction 3343
please 3343
interior 3341
scandal 3341
owners 3338
content 3335
islands 3335
approved 3333
baghdad 3332
prize 3331
digital 3322
towards 3321
develop 3320
thank 3320
diplomatic 3318
reaction 3316
associated 3315
stood 3315
walked 3315
championship 3314
pair 3313
unit 3309
statements 3308
count 3302
lake 3302
marijuana 3301
memorial 3299
reportedly 3297
drop 3296
supporting 3296
pennsylvania 3294
trouble 3292
visited 3291
features 3288
enjoy 3286
extra 3282
sending 3279
earned 3273
testimony 3273
proposed 3270
animal 3268
contract 3267
rich 3267
allows 3266
rising 3265
apartment 3262
peaceful 3262
covered 3260
inspired 3254
struggle 3251
emotional 3249
native 3247
1,000 3245
explain 3245
changing 3241
bigger 3240
feels 3240
wilson 3240
accounts 3239
fly 3239
500 3238
closer 3238
strikes 3238
quick 3235
standard 3235
phones 3234
kerry 3233
effects 3232
adults 3229
wake 3229
sun 3227
lady 3226
require 3226
linked 3225
angry 3222
allies 3220
incidents 3218
setting 3217
woods 3217
headed 3216
awards 3214
abu 3213
citing 3213
criticized 3212
nfl 3212
write 3212
regular 3210
state-run 3206
card 3204
reading 3201
hero 3200
attempted 3199
facilities 3199
basic 3198
neither 3195
iphone 3192
poverty 3186
films 3183
investigating 3183
produce 3181
pushed 3179
complaint 3178
sit 3177
fresh 3176
bombing 3175
detained 3175
veteran 3175
background 3173
investment 3170
actress 3169
fifa 3169
widely 3168
shots 3167
controversy 3165
items 3163
90 3158
located 3158
expert 3157
facts 3157
prove 3151
remarks 3150
brand 3147
artist 3146
rice 3146
mountain 3145
supposed 3145
teacher 3144
benefit 3143
surrounding 3137
enter 3135
somebody 3135
el 3134
jordan 3133
destroyed 3131
tennis 3131
watched 3130
cash 3129
confidence 3127
territory 3127
researchers 3126
jim 3125
eric 3124
options 3121
fit 3120
proposal 3119
negotiations 3116
communications 3115
holiday 3114
truly 3113
referring 3110
polls 3109
task 3109
ceremony 3107
commander 3107
sleep 3104
developing 3103
offering 3103
established 3102
stands 3101
earthquake 3100
danger 3097
projects 3097
definitely 3095
option 3093
soldier 3091
shut 3090
zimmerman 3090
2000 3087
anniversary 3087
passenger 3086
prosecution 3085
turning 3084
queen 3082
touch 3081
picked 3076
repeatedly 3073
pentagon 3072
illinois 3068
traveled 3068
drew 3064
et 3062
festival 3056
wind 3056
dozen 3054
income 3054
pop 3052
wide 3052
wish 3052
bid 3048
commitment 3047
mohammed 3046
identify 3044
striker 3044
courts 3043
easily 3040
intended 3030
iowa 3030
representatives 3029
dad 3025
banks 3024
funds 3024
planet 3024
acknowledged 3021
francisco 3020
managed 3015
elsewhere 3012
nice 3011
ride 3011
arabia 3010
ties 3010
provides 3009
racial 3008
# 3007
leg 3007
favor 3006
houses 3005
direction 3004
teachers 3002
numerous 3001
potentially 3001
alabama 3000
gathered 3000
perry 3000
seats 2999
michigan 2994
waters 2991
demonstrators 2990
consumers 2988
weapon 2986
filled 2985
paying 2983
port 2981
islam 2980
suspended 2980
panel 2978
relatives 2978
29 2976
louisiana 2976
marine 2976
tensions 2976
blame 2975
commissioner 2973
possibly 2973
reporting 2972
rose 2971
analyst 2970
tragedy 2968
kingdom 2965
aviation 2961
minority 2960
charles 2959
cited 2954
extreme 2953
heat 2953
drivers 2952
division 2950
nobody 2949
route 2949
attend 2947
homeland 2945
impossible 2945
35 2942
stone 2942
document 2936
learning 2935
kenya 2932
false 2931
retired 2930
missed 2928
libyan 2926
hurricane 2924
identity 2923
banned 2922
era 2921
unless 2921
circumstances 2919
mississippi 2919
300 2918
reserved 2918
targets 2917
increasing 2914
worried 2909
rebel 2906
winds 2903
colleagues 2899
realize 2898
youtube 2896
christie 2895
2016 2894
teen 2892
uses 2889
dogs 2888
opportunities 2886
prompted 2886
adds 2885
sudan 2885
unclear 2884
selling 2881
killings 2875
markets 2875
medicine 2872
damaged 2867
miami 2866
valley 2865
advice 2864
inches 2864
pleaded 2863
widespread 2863
supported 2862
— 2861
infrastructure 2858
ben 2853
analysts 2849
cool 2848
fled 2848
senator 2846
soccer 2846
heads 2845
escape 2843
requires 2842
breaking 2841
neighbors 2837
tweeted 2837
completed 2836
organized 2836
easier 2835
plenty 2834
familiar 2833
experienced 2832
welcome 2832
unlikely 2829
express 2828
long-term 2827
meters 2826
harry 2825
meaning 2819
rejected 2819
smaller 2819
feature 2818
refugees 2818
taxes 2816
speaker 2815
wear 2814
prisoners 2813
attended 2808
interesting 2808
collection 2805
struggling 2805
aimed 2804
houston 2804
athletes 2800
attorneys 2799
remaining 2798
realized 2796
strength 2796
regarding 2794
gen. 2790
fish 2786
internal 2786
interested 2784
artists 2783
guests 2783
analysis 2780
constitutional 2780
helps 2780
tech 2779
31 2778
alcohol 2777
catholic 2777
ukrainian 2777
tourists 2776
surprised 2775
tied 2775
spirit 2771
recorded 2770
display 2769
promised 2768
racing 2767
understanding 2765
section 2764
skin 2764
thinks 2763
generally 2761
bureau 2758
supplies 2756
kid 2751
matters 2750
travelers 2750
blamed 2749
expensive 2749
plus 2749
adult 2747
oklahoma 2747
clubs 2746
partners 2746
fought 2745
greece 2745
outbreak 2745
anger 2744
ethnic 2742
explosion 2741
fears 2740
citizen 2739
beating 2734
estimates 2734
returning 2733
recognize 2732
eating 2730
pointed 2730
democrat 2729
affect 2726
comedy 2726
bed 2724
questioned 2722
jewish 2720
smart 2719
ok 2718
glass 2717
founder 2716
argentina 2714
confident 2713
becomes 2712
bought 2712
activist 2711
gain 2710
representative 2710
considering 2708
hate 2708
pull 2707
negative 2706
religion 2706
basis 2705
hospitals 2705
otherwise 2703
opposed 2702
forget 2701
independence 2698
relatively 2698
fox 2697
skills 2696
vast 2696
surface 2694
color 2692
raising 2686
continuing 2685
roads 2684
command 2679
slow 2677
kelly 2676
treat 2672
u.s 2671
asian 2670
characters 2670
african-american 2668
miller 2668
militant 2667
roughly 2663
boehner 2662
so-called 2662
sky 2661
missouri 2660
opponents 2660
employee 2659
roll 2658
cruise 2657
corner 2656
vision 2656
limit 2655
oh 2655
illness 2653
symptoms 2653
thoughts 2653
text 2650
summit 2649
wedding 2649
dealing 2646
client 2643
turns 2643
sale 2642
academy 2641
survived 2641
truck 2640
session 2637
powers 2635
baseball 2632
stores 2632
songs 2631
describe 2630
toll 2625
ireland 2619
aboard 2617
prior 2616
delivered 2613
approval 2611
resort 2609
supply 2607
deliver 2606
drone 2605
mistake 2605
shop 2605
worry 2603
defend 2602
plays 2601
appeals 2600
legacy 2598
degree 2595
suggests 2594
closely 2593
risks 2593
values 2592
receiving 2591
wars 2591
ships 2589
introduced 2588
apart 2587
confirm 2586
accepted 2584
window 2584
notes 2583
producer 2582
reporter 2582
discussion 2580
rooms 2577
suggest 2576
engaged 2575
kevin 2574
recalled 2572
pushing 2570
unfortunately 2568
maintain 2567
represent 2567
broadcast 2565
promise 2565
cdc 2564
planes 2564
chances 2563
innocent 2563
unemployment 2563
consequences 2561
hernandez 2560
pacific 2560
demonstrations 2559
borders 2558
core 2557
exercise 2557
sick 2555
carter 2553
dramatic 2553
involvement 2552
45 2549
taylor 2548
positions 2547
theater 2546
afraid 2544
anderson 2544
dna 2543
bob 2542
seed 2542
foot 2541
block 2540
crashed 2538
dinner 2534
housing 2530
clashes 2529
equal 2525
sets 2522
appropriate 2520
prevention 2520
shock 2517
visiting 2517
amendment 2516
biden 2516
holder 2516
resident 2516
louis 2515
specifically 2513
unlike 2513
daniel 2511
achieve 2508
balance 2508
flooding 2507
pieces 2507
islamist 2504
knowing 2504
offensive 2503
unusual 2503
tokyo 2502
bond 2501
explains 2501
attempts 2500
alternative 2499
cameras 2498
wild 2498
alongside 2495
leads 2494
harm 2490
mubarak 2490
hotels 2488
networks 2487
cooperation 2486
mary 2485
sat 2482
medal 2481
ad 2480
morgan 2478
wave 2477
couples 2474
missile 2474
remove 2474
ford 2473
elizabeth 2469
typically 2469
causing 2468
detention 2466
comfortable 2463
arm 2462
basketball 2461
heavily 2461
argument 2460
connecticut 2458
originally 2458
gates 2457
races 2456
windows 2456
amnesty 2455
conservatives 2455
writer 2452
canadian 2451
seized 2451
obamacare 2450
rally 2449
sees 2449
pool 2446
inc. 2444
presented 2444
campus 2442
concluded 2442
presidency 2441
reforms 2441
duty 2440
transcript 2433
cairo 2431
factor 2429
arrests 2428
materials 2428
frank 2424
milan 2424
rival 2424
apparent 2423
diego 2423
memory 2423
ending 2420
flag 2420
sounds 2416
reputation 2415
wonder 2415
bear 2412
agenda 2408
celebrity 2408
aside 2407
listen 2407
beaten 2405
jr. 2405
survivors 2404
convention 2401
connected 2399
investigate 2399
flu 2397
score 2397
answers 2393
horse 2393
fewer 2391
advance 2390
landing 2390
granted 2389
handle 2385
passing 2384
recognized 2384
sad 2384
worker 2383
emerged 2382
maryland 2379
arsenal 2378
bombs 2375
stress 2375
machine 2372
netanyahu 2371
fort 2367
mine 2367
shopping 2367
claiming 2366
titles 2364
grown 2362
scale 2362
abortion 2361
recovered 2360
slam 2360
indicated 2358
ticket 2358
funeral 2357
holds 2353
demands 2351
rolling 2350
transfer 2350
defending 2349
incredible 2349
smoke 2349
9/11 2346
causes 2346
represents 2346
estate 2345
handed 2344
jet 2343
highway 2342
neighboring 2341
palace 2340
shoot 2337
verdict 2335
wins 2334
thailand 2333
pilots 2330
helicopter 2328
overseas 2328
code 2326
lebanon 2326
consumer 2325
mandela 2324
@ 2323
purpose 2323
targeting 2321
golden 2320
nationwide 2320
10,000 2319
1999 2319
federer 2319
charity 2318
tehran 2318
allen 2315
capacity 2313
liberal 2313
tested 2313
crazy 2312
talent 2312
except 2310
stayed 2310
experiences 2309
rural 2308
priority 2306
owned 2305
letters 2303
proved 2303
clothes 2302
user 2302
w. 2300
canceled 2298
gender 2298
moon 2298
lots 2297
jose 2296
anywhere 2295
mention 2294
jack 2292
trees 2292
catch 2288
desire 2288
edge 2286
patrol 2285
profile 2285
viewers 2285
plot 2284
sharing 2284
drinking 2283
pregnant 2283
shape 2283
shift 2282
formula 2281
orleans 2281
bag 2278
castro 2278
intense 2278
birthday 2277
guide 2276
heading 2276
liverpool 2276
sarah 2276
conviction 2275
tens 2274
compete 2272
gotten 2272
minor 2272
calm 2271
corporate 2269
philadelphia 2269
© 2266
sons 2264
classic 2262
longtime 2261
nomination 2261
plastic 2261
urban 2259
leaves 2258
doors 2257
drink 2257
variety 2257
sector 2256
stepped 2255
journal 2253
eu 2252
begins 2251
argue 2250
chavez 2250
trained 2250
ourselves 2249
notice 2247
palestinians 2247
andrew 2246
excited 2241
platform 2241
row 2241
cameron 2240
discovery 2240
headquarters 2240
upset 2240
discrimination 2239
institutions 2239
restaurants 2238
initiative 2233
transition 2233
insisted 2232
kentucky 2232
dispute 2230
abroad 2229
importance 2228
tennessee 2227
drama 2226
reaching 2226
silver 2226
backed 2225
creative 2224
delay 2224
quoted 2222
stronger 2220
snowden 2219
suddenly 2219
locations 2218
dutch 2216
remote 2216
chose 2215
officially 2215
wonderful 2214
extended 2213
judges 2213
tiny 2213
capture 2208
mitt 2208
folks 2207
vietnam 2206
moves 2205
fame 2203
restrictions 2197
palin 2196
santa 2194
brian 2193
promote 2193
dubai 2192
sparked 2192
torture 2192
coffee 2191
instance 2191
unknown 2190
performed 2188
parent 2187
species 2187
transport 2187
drove 2186
meetings 2184
communication 2182
tim 2182
destruction 2181
permanent 2181
150 2177
outcome 2176
reagan 2176
gift 2175
nadal 2174
temperatures 2174
contest 2173
distance 2173
vegas 2173
behalf 2171
quiet 2171
fraud 2170
adviser 2166
airports 2166
brings 2166
satellite 2166
dance 2165
everywhere 2162
nbc 2162
encourage 2161
beauty 2160
blast 2160
perform 2160
qatar 2159
maria 2157
sorry 2157
channel 2156
peninsula 2154
tradition 2153
1990s 2152
bowl 2152
32 2151
degrees 2150
tend 2150
survive 2149
orders 2148
starts 2148
tony 2148
malaysia 2147
vessel 2147
warrant 2147
package 2146
rivals 2146
tourism 2146
towns 2146
anybody 2145
debut 2145
failing 2144
falling 2143
cooper 2142
crucial 2139
gang 2139
afford 2138
100,000 2136
bars 2135
basically 2135
dialogue 2135
accusations 2134
armstrong 2134
grant 2134
software 2133
temporary 2133
electricity 2130
lucky 2130
rocket 2130
marked 2129
sunni 2128
brazilian 2125
stated 2125
map 2124
dedicated 2123
likes 2121
ends 2119
brief 2117
episode 2117
luxury 2117
hoped 2116
closing 2115
stability 2115
obtained 2114
apps 2111
nba 2111
politically 2111
philippines 2109
punishment 2109
teenager 2109
types 2107
landed 2106
strongly 2106
circuit 2105
fiscal 2104
alert 2103
harris 2103
globe 2101
gained 2100
teens 2100
sandy 2099
alaska 2096
directed 2096
tree 2096
findings 2095
marketing 2095
factors 2093
lewis 2093
staying 2093
indictment 2092
interviews 2092
effectively 2091
walker 2091
regularly 2090
regardless 2089
ages 2088
b 2088
founded 2088
harder 2086
regulations 2086
saved 2086
joseph 2084
celebrate 2083
monitoring 2083
rick 2082
bills 2081
featured 2080
oscar 2080
brotherhood 2079
scenes 2078
farm 2076
finance 2076
atlantic 2074
busy 2072
revenue 2072
terrible 2072
strategic 2068
investigations 2066
personally 2066
ten 2065
actual 2064
tears 2064
kinds 2063
documentary 2062
boss 2061
buried 2061
waste 2061
lies 2060
patrick 2060
cards 2058
ring 2057
net 2056
forest 2055
high-profile 2055
drawn 2054
clinic 2053
1998 2052
2015 2050
ray 2050
tickets 2049
addressed 2048
shocked 2048
engine 2047
haram 2047
referred 2046
dismissed 2045
las 2043
zealand 2041
mountains 2039
therefore 2038
link 2037
noting 2034
feed 2033
plea 2033
sixth 2032
resulted 2029
unrest 2028
walls 2028
assembly 2027
firing 2027
morsy 2024
puts 2024
atmosphere 2023
indonesia 2023
lights 2023
ted 2023
vulnerable 2019
conspiracy 2017
fix 2017
mph 2016
tonight 2016
file 2015
girlfriend 2014
manhattan 2014
trafficking 2014
kansas 2013
boko 2012
checks 2010
copyright 2010
400 2007
forever 2007
humans 2006
winners 2004
defender 2003
marks 2003
practices 2003
meat 2001
blow 2000
dress 2000
continent 1999
stuck 1999
guards 1998
bail 1997
registered 1997
describes 1996
existing 1996
airstrikes 1994
bombings 1994
hits 1994
quarter 1994
searching 1994
structure 1994
wisconsin 1994
hole 1993
adam 1992
buying 1992
condemned 1992
trail 1992
deals 1991
enemy 1991
controlled 1990
presidents 1990
entirely 1987
tragic 1987
daughters 1986
minnesota 1986
reduced 1986
apply 1985
prepare 1985
marathon 1984
regions 1983
technical 1983
repeated 1982
djokovic 1981
replace 1978
ads 1977
maximum 1977
neighbor 1976
tools 1976
fda 1975
prominent 1974
ancient 1972
camps 1972
observers 1970
moore 1969
indiana 1968
obvious 1968
abc 1966
elements 1966
minimum 1966
limits 1965
totally 1965
bp 1964
killer 1964
burned 1963
volunteers 1963
classes 1962
recording 1961
1994 1960
disappeared 1960
jason 1960
violation 1959
fallen 1958
protecting 1958
susan 1958
demanding 1957
shootings 1957
graham 1955
formed 1953
jerusalem 1953
stations 1953
tsa 1950
differences 1949
radical 1949
split 1949
headlines 1948
exist 1947
jurors 1945
monitor 1944
compound 1943
pages 1942
proper 1942
participate 1941
henry 1940
p.m 1940
settlement 1940
memories 1939
cuban 1938
license 1938
northeast 1938
larry 1937
benghazi 1936
scientific 1936
driven 1935
awareness 1932
shelter 1932
southwest 1932
overnight 1930
requests 1930
wildlife 1929
ahmed 1928
ill 1928
necessarily 1928
exposed 1927
75 1924
concept 1924
heroes 1924
alliance 1923
contained 1918
michelle 1918
gap 1917
studio 1917
offices 1915
actors 1914
debris 1913
competitive 1912
flood 1911
communist 1909
followers 1909
threatening 1909
dallas 1908
ireport 1907
laid 1907
slightly 1907
anymore 1906
spill 1906
vaccine 1906
execution 1905
solar 1905
complicated 1904
crowds 1904
kidnapping 1903
arguments 1902
relationships 1902
affordable 1901
combined 1901
screening 1901
surrounded 1901
writes 1901
boost 1900
diagnosed 1900
tool 1899
violations 1899
passion 1897
alex 1896
clothing 1896
brutal 1895
2,000 1894
48 1894
procedures 1894
laura 1893
al-shabaab 1892
chain 1892
electric 1889
trend 1889
adopted 1887
choices 1887
disappointed 1884
explosives 1884
guess 1884
taught 1884
extraordinary 1883
lt. 1883
struggled 1883
discussed 1880
francis 1880
senators 1880
kurdish 1877
soviet 1877
defended 1875
casualties 1874
mount 1874
preparing 1874
squad 1873
cabinet 1872
posts 1872
upcoming 1872
capable 1871
columbia 1871
literally 1871
capitol 1870
myanmar 1870
va 1870
orange 1869
intervention 1867
perspective 1867
aggressive 1865
sterling 1865
barbara 1864
electronic 1864
opponent 1864
campaigns 1862
fighter 1862
improved 1862
nonprofit 1862
cbs 1861
complaints 1861
cutting 1861
legitimate 1861
1980s 1860
chosen 1860
pistorius 1860
latin 1859
venezuela 1859
lay 1858
sporting 1858
engage 1857
possession 1857
ed 1855
heritage 1855
representing 1855
units 1855
1996 1854
goods 1854
invited 1854
pitch 1854
shoes 1854
lincoln 1852
models 1852
stock 1852
concert 1851
firefighters 1851
ipad 1851
thus 1851
wealth 1850
childhood 1849
33 1847
downtown 1847
tsarnaev 1846
correspondent 1844
enjoyed 1844
motion 1844
zero 1844
begun 1843
spoken 1843
voices 1843
corps 1839
mohamed 1839
cook 1838
burning 1837
fishing 1836
faster 1834
slowly 1834
infection 1833
dan 1832
essential 1831
pursue 1831
disappearance 1830
frequently 1830
collapse 1828
cruz 1828
grounds 1827
listed 1827
normally 1827
vital 1827
cable 1825
footage 1825
computers 1824
depression 1824
reid 1824
challenging 1822
replaced 1822
enormous 1821
noticed 1820
dying 1817
mix 1817
telephone 1817
legs 1816
mall 1815
microsoft 1815
nelson 1815
netherlands 1815
fill 1814
nominee 1813
crews 1811
hampshire 1811
moral 1811
keeps 1810
operate 1810
dating 1809
manner 1808
tomorrow 1808
protected 1807
colombia 1806
speculation 1805
andy 1804
suffer 1804
advocates 1803
expand 1803
interviewed 1803
vatican 1801
newly 1800
schedule 1799
empty 1798
signing 1798
tie 1798
commit 1797
jump 1797
resolve 1797
sensitive 1794
hawaii 1793
photographs 1792
rush 1792
arrive 1791
wine 1791
1970s 1790
hunt 1790
joining 1790
racist 1789
wood 1789
boeing 1787
deficit 1787
masters 1787
establish 1786
pending 1786
desert 1785
reflect 1784
handling 1783
mosque 1783
purchase 1783
stephen 1783
joy 1782
musical 1782
mixed 1781
scores 1781
bayern 1780
mars 1780
northwest 1780
honest 1779
greg 1778
hired 1778
matt 1778
metal 1778
scotland 1778
gunman 1777
lying 1777
carbon 1775
hiv 1775
pace 1775
unprecedented 1774
bags 1773
coup 1773
funny 1773
jonathan 1773
greek 1772
warm 1771
roberts 1770
seattle 1770
exciting 1768
hamilton 1767
6-3 1766
gray 1766
organizers 1766
remarkable 1766
deployed 1764
infected 1764
typical 1763
lie 1762
faa 1761
mentioned 1761
cells 1760
stable 1759
plants 1758
shiite 1758
judicial 1757
yesterday 1757
impressive 1756
somewhere 1756
tribute 1755
lessons 1753
novel 1753
roles 1752
flew 1751
nigerian 1751
broad 1748
nancy 1748
chaos 1747
tourist 1747
khan 1746
throw 1742
boats 1739
devastating 1738
gathering 1738
mothers 1738
na 1738
abandoned 1737
humanity 1737
raid 1736
rio 1736
displaced 1734
approximately 1733
conversations 1733
attempting 1732
predicted 1732
dressed 1731
represented 1731
praised 1730
preliminary 1730
detroit 1729
encouraged 1729
jennifer 1729
ew.com 1728
36 1727
switzerland 1727
detail 1726
latino 1726
reasonable 1726
detailed 1723
discussions 1722
disney 1722
earn 1722
solutions 1722
beer 1721
falls 1721
neck 1721
hitting 1720
approached 1718
hundred 1718
refugee 1718
1997 1717
dreams 1716
advanced 1714
generations 1714
moderate 1714
rounds 1714
quake 1712
arrival 1711
consistent 1711
packed 1710
intent 1709
pirates 1709
poland 1709
destination 1708
readers 1708
usa 1708
yellow 1708
designer 1707
clients 1706
contacted 1706
crown 1706
divided 1705
entering 1705
category 1704
detainees 1704
equality 1704
recall 1704
stolen 1704
demanded 1703
hopefully 1703
percentage 1703
affair 1702
significantly 1701
babies 1700
follows 1700
legally 1700
scared 1700
utah 1699
bright 1698
elite 1698
pyongyang 1698
statistics 1698
contrast 1696
singapore 1696
sweden 1696
racism 1695
911 1694
historical 1694
belief 1693
prix 1693
requested 1693
exit 1692
finds 1692
somehow 1692
charlie 1691
sight 1691
missiles 1689
azuz 1688
aim 1687
tape 1687
amounts 1685
arts 1685
e-mails 1685
southeast 1685
governing 1684
aftermath 1683
vacation 1683
links 1682
nevada 1681
parks 1680
partnership 1680
garden 1679
informed 1679
tower 1679
vowed 1678
steven 1677
solve 1676
wimbledon 1676
rome 1675
tribal 1675
comprehensive 1674
blocked 1673
clark 1672
papers 1672
permission 1672
sexually 1671
tweet 1671
abdullah 1670
grave 1670
deserve 1669
handful 1668
6-4 1667
farmers 1666
successfully 1666
affidavit 1665
knox 1664
watson 1663
properly 1662
collected 1661
desperate 1661
tiger 1660
tornado 1659
fatal 1658
mistakes 1658
sgt 1658
clash 1657
parking 1657
silence 1656
trapped 1656
acted 1654
arkansas 1654
attending 1654
questioning 1654
legend 1653
listening 1652
celebrities 1651
f1 1651
pride 1651
compromise 1649
lifetime 1648
outrage 1648
locked 1647
matthew 1647
probation 1646
thompson 1646
reveal 1645
midfielder 1644
isolated 1643
justices 1643
routine 1643
disorder 1642
gary 1642
stewart 1642
rarely 1641
popularity 1640
covering 1639
fate 1638
formal 1638
friendly 1638
posting 1638
jesus 1637
barely 1636
grace 1636
imposed 1636
appointed 1635
emerging 1635
crackdown 1634
iconic 1634
wounds 1634
illegally 1633
alan 1632
awarded 1632
library 1632
essentially 1631
judgment 1631
mile 1630
unions 1630
massacre 1629
rescued 1629
alexander 1628
combination 1628
fields 1628
participants 1628
breast 1627
deny 1626
creation 1625
invasion 1623
smile 1623
5,000 1622
teach 1622
extensive 1619
hidden 1619
victoria 1618
concrete 1617
fees 1617
ultimate 1617
constant 1616
indicate 1614
warnings 1614
apology 1613
berlin 1613
holy 1613
nick 1613
supports 1613
android 1611
forms 1611
rodriguez 1611
crossed 1610
exposure 1610
extend 1610
odds 1610
spotlight 1610
re-election 1609
convinced 1607
exclusive 1607
incredibly 1607
usual 1607
surprising 1606
trips 1606
jeff 1605
federation 1604
hispanic 1603
roger 1602
tours 1602
resulting 1600
theme 1599
cleared 1597
kidnapped 1597
minds 1597
oregon 1597
erupted 1596
ordinary 1596
achieved 1595
extent 1595
fail 1595
flow 1595
guest 1595
bashar 1594
nobel 1593
photographer 1593
theory 1593
weak 1593
feelings 1592
oldest 1592
tip 1592
collapsed 1591
wing 1591
maintained 1590
sri 1589
universal 1589
authorized 1587
harvard 1587
investors 1587
defendants 1586
industrial 1586
delhi 1585
hussein 1585
seasons 1585
viewed 1585
edward 1584
recession 1584
apologized 1583
cycle 1583
manage 1583
villages 1583
battling 1582
overcome 1582
extremists 1581
singing 1578
tsunami 1578
diseases 1577
procedure 1577
tons 1576
42 1575
contain 1575
drawing 1575
recognition 1575
wore 1575
jay 1574
dominated 1573
bloody 1572
criminals 1572
recover 1572
producing 1571
sony 1571
karzai 1570
lunch 1570
kabul 1569
occur 1569
reference 1569
stick 1569
2-1 1567
anonymous 1567
damascus 1567
escaped 1567
petition 1567
teaching 1567
master 1564
voter 1564
65 1563
legislative 1563
gallery 1562
cargo 1561
grateful 1561
hearts 1561
serves 1561
attacking 1559
prayers 1559
phillips 1558
resignation 1558
donations 1557
succeed 1557
waves 1557
threw 1556
motivated 1555
smoking 1555
sustained 1555
soil 1554
upper 1554
courage 1553
swiss 1552
ballot 1551
constantly 1550
felony 1550
1995 1549
2-0 1549
3,000 1549
assets 1549
ranks 1549
visits 1549
warren 1549
garcia 1548
inmates 1548
tripoli 1548
explosive 1547
cocaine 1546
featuring 1546
retirement 1546
tips 1545
ally 1544
graduate 1544
tropical 1544
broader 1543
phil 1543
storms 1543
tear 1543
hosted 1542
volunteer 1542
comfort 1541
stressed 1541
christopher 1540
riding 1540
sharp 1540
foster 1538
safely 1538
seventh 1538
expectations 1537
thrown 1537
conclusion 1536
courtroom 1536
gunmen 1536
inspiration 1536
resigned 1536
application 1535
christians 1535
hosts 1535
signal 1535
therapy 1535
tactics 1534
kick 1533
principal 1533
disputed 1531
competing 1529
promises 1529
violated 1529
sandusky 1528
seoul 1528
institution 1527
applied 1525
helicopters 1525
hills 1525
hostages 1525
openly 1524
opposite 1523
pledged 1523
amazon 1522
medicare 1521
exploded 1519
jong 1519
proof 1519
delayed 1518
anti-government 1517
rhetoric 1517
howard 1515
1960s 1514
ahmadinejad 1512
backing 1510
witnessed 1510
lifted 1509
underground 1509
connect 1508
hunger 1508
interim 1507
assessment 1506
dollar 1505
ronaldo 1505
recalls 1504
remembered 1504
copy 1503
entry 1503
jumped 1503
proceedings 1503
34 1502
roof 1502
scoring 1502
complained 1501
lab 1501
swimming 1501
defendant 1500
associate 1499
rivers 1499
sam 1499
cape 1498
simon 1498
survival 1498
mouth 1497
38 1495
explore 1495
maps 1495
tank 1495
nsa 1494
sisters 1494
phase 1493
championships 1492
firearms 1492
fires 1492
divorce 1491
liberty 1491
restore 1491
tunisia 1491
advertising 1490
coastal 1490
mcconnell 1490
performing 1490
inquiry 1489
1-0 1488
del 1488
hiding 1488
ivory 1488
passage 1488
tight 1488
situations 1487
edwards 1486
1991 1485
context 1485
fat 1485
mainly 1485
messi 1485
crossing 1483
diet 1483
irish 1483
justin 1483
magic 1483
overwhelming 1483
crimea 1481
celebration 1480
chair 1480
lopez 1480
tracks 1480
arguing 1479
classified 1479
phoenix 1479
battery 1478
managing 1478
